//=============================================================================
//
// 背景処理 [background.h]
// Author : 
//
//=============================================================================
#ifndef _BACKGROUND_H_
#define _BACKGROUND_H_

#include "main.h"


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitBackground();
void UninitBackground();
void UpdateBackground();
void DrawBackground();

#endif